#### PlasticvinylApplicationType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "PlasticvinylApplication" from the "PlasticVinyl" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum PlasticvinylApplicationType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PlasticvinylApplicationType ``` |

| Visual C++ |
| --- |
| ``` public enum class PlasticvinylApplicationType ``` |

# Members

| Member name | Description |
| --- | --- |
| Polished |  |
| Glossy |  |
| Matte |  |

# See Also

Autodesk.Revit.DB.Visual Namespace